Repository: MarkusBauer/secretnote
Catalog: secretnote-fe/src/locale/messages.*.xlf
Languages: de

# ngb.alert.close
source: Close
de: Schließen

# ngb.carousel.slide-number
source: Slide {{i + 1}} of {{c}}
de: Seite {{i + 1}} von {{c}}

# ngb.carousel.previous
source: Previous
de: Vorherige

# ngb.carousel.next
source: Next
de: Nächste

# ngb.datepicker.previous-month
source: Previous month
de: Letzter Monat

# ngb.datepicker.next-month
source: Next month
de: Nächster Monat

# ngb.datepicker.select-month
source: Select month
de: Monat wählen

# ngb.datepicker.select-year
source: Select year
de: Jahr wählen

# ngb.pagination.first-aria
source: First
de: Erste

# ngb.pagination.previous-aria
source: Previous
de: Vorherige

# ngb.pagination.next-aria
source: Next
de: Nächste

# ngb.pagination.last-aria
source: Last
de: Letzte

# ngb.timepicker.increment-hours
source: Increment hours
de: Erhöhe Stunden

# ngb.timepicker.hours
source: Hours
de: Stunden

# ngb.timepicker.decrement-hours
source: Decrement hours
de: Erniedrige Stunden

# ngb.timepicker.minutes
source: Minutes
de: Minuten

# ngb.timepicker.seconds
source: Seconds
de: Sekunden

# ngb.toast.close-aria
source: Close
de: Schließen

source: Store a note - encrypted!
de: Speichern Sie Ihre Nachricht - verschlüsselt!

source: Store Note
de: Speichern

source: With a second <span>admin link</span> you will be able to see when your note has been read.
de: Mit einem <span>administrativen Link</span> können Sie feststellen wenn Ihre Nachricht gelesen wird.

source: Notes are deleted after they have been read one, latest 7 days after creation.
de: Nachrichten werden nach einmaligem Lesen zerstört, spätestens aber nach 7 Tagen.

source: Public chat URL:
de: Öffentliche URL:

source: Share this link with your chat mates
de: Teilen Sie diesen Link mit ihren Chat-Partnern

source: Personal chat URL:
de: Persönliche URL:

source: Save this link for yourself to retain access to your chatname
de: Speichern Sie diesen Link, um ihren Chat-Namen zu behalten

source: write your message ...
de: Schreiben Sie Ihre Nachricht ...

source: connection established
de: Verbindung hergestellt

source: connection interrupted, reconnecting ...
de: Verbindung unterbrochen, wird wiederverbunden ...

source: loading more messages ...
de: weitere Nachrichten laden ...

source: (load {{knownMessageSize - loadedMessages}} more messages ...)
de: (lade {{knownMessageSize - loadedMessages}} weitere Nachrichten ...)

source: Write a message to start this chat!
de: Schreiben Sie eine Nachricht um diesen Chat zu starten!

source: Create a new chat, secret and anonymous.
de: Erstellen Sie einen neuen Chat, sicher und anonym.

source: For a chat you'll get two links:
de: Zum Chat bekommen Sie zwei Links:

source: A <span>public link</span> to share with others. With this link they can read the chat and write with new names.
de: Einen <span>öffentlichen Link</span>, den Sie mit Anderen teilen können. Mit diesem Link können andere Teilnehmer am Chat unter neuem Namen teilnehmen.

source: A <span>personal link</span> only for you, <strong>save this link</strong> to keep your chat name.
de: Einen <span>persönlichen Link</span> für Sie, <strong>speichern Sie sich diesen Link</strong> um ihren Chat-Namen zu behalten.

source: Chats will vanish after 7 days without interaction.
de: Chats verschwinden nach 7 Tagen ohne Interaktion.

source: About SecretNote
de: Über SecretNote

source: Not found
de: Seite nicht gefunden

source: This page does not exist.
de: Diese Seite existiert nicht.

source: Loading...
de: Laden...

source: loading ...
de: laden ...

source: This message has already been read (or the URL is invalid)
de: Diese Nachricht wurde bereits gelesen (oder diese URL ist ungültig)

source: Message could not be read.
de: Nachricht konnte nicht gelesen werden.

source: Your message is ready!
de: Ihre Nachricht ist verfügbar!

source: Remember: it can only be read once, afterwards it will be destructed.
de: Achtung: Lesen ist nur einmal möglich, danach wird die Nachricht zerstört.

source: Identifier
de: ID

source: Read Note
de: Nachricht lesen

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: Why?
de: Warum?

# faq-why-1
source: Imagine you want to send someone a password over messenger. Years later someone could go back in your message history and reveal the password! But if you put it in a secret note and send the link, it will not be recoverable.
de: Stell dir vor, du möchtest ein Passwort über einen beliebigen Messenger senden. Selbst Jahre später könnte jemand einen Nachrichtenverlauf lesen und das Passwort herausfinden! Wenn du das Passwort stattdessen in eine SecretNote-Nachricht schreibst und den Link verschickst kann niemand das Passwort herausfinden!

# faq-why-2
source: Imagine you want to send something private to your friend, but he has the feeling that his parents/wife/boss occasionally read his mails (which they of course disclaim). If you put your messages in a secret note, the intruder cannot use the link and read the message without revealing that he's sniffing. If your friend wants uses the secret link and it has already been invalidated, it's obvious that it was sniffed.
de: Stell dir vor, du möchtest Privates an einen Freund schicken, aber er hat den Verdacht dass seine Eltern/Freundin/Chef gelegentlich seine Mails lesen. Wenn du deine Nachrichten mit SecretNote schreibst kann der Schnüffler den Link nicht nutzen, ohne preiszugeben dass er schnüffelt. Wenn dein Freund den Link benutzen will und der Link bereits ungültig gemacht wurde wisst ihr, dass jemand eure Nachrichten liest.

source: Do I know when the note has been read?
de: Weiß ich wann eine Nachricht gelesen wurde?

# faq-read
source: After creating a note you'll get an admin link. With this link you can check if your note has been read.
de: Nach dem Speichern einer Nachricht bekommst du einen Admin-Link. Mit diesem Link kannst du überprüfen wann deine Nachricht gelesen wurde.

source: How are notes protected?
de: Wie sind Nachrichten geschützt?

# faq-protected
source: Your notes are protected using state-of-the-art end-to-end encryption (AES-GCM-128 with authentication). The communication to the server is again encrypted using TLS. Your encryption keys are never send over network.
de: Deine Nachrichten sind mit modernster Ende-zu-Ende-Verschlüsselung gesichert (AES-GCM-128 mit Authentifizierung). Die Kommunikation mit dem Server ist zusätzlich verschlüsselt (mit TLS). Die zur Verschlüsselung notwendigen Schlüssel werden niemals über das Netzwerk versendet.

source: Why is Javascript required?
de: Warum wird Javascript benötigt?

# faq-js
source: Without scripting it is not possible to keep your message secret, because someone else would have to carry out encryption for you. Your note should be secret to you and the recipient, right? Your note is secret as long as only you and your recipient have its <em>encryption key</em>. And here we need Javascript: Browser-side scripting is the only way to keep the encryption key in your browser - without scripting, the server would have to carry out encryption (and therefore need the encryption key). But if the server would get the encryption key, he could (in theory) decrypt and read your secret note, and you wouldn't even notice. But <strong>with javascript, your note is safe</strong> even from rogue servers, because your encryption key is never sent.
de: Ohne Scripting ist es nicht möglich deine Nachricht geheim zu halten, weil dann ein anderer Computer die Verschlüsselung berechnen müsste. Deine Nachricht sollte nur von Dir und dem Empfänger gelesen werden können. Aber deine Nachricht ist nur sicher so lange nur Du und der Empfänger den <em>kryptographischen Schlüssel</em> kennen. Hierzu brauchen wir Javascript: Ein Script das dein Browser ausführt ist die einzige Möglichkeit den Schlüssel nur in deinem Browser zu lassen - ohne Scripts müsste der Server die Verschlüsselung für Dich berechnen (und dafür den Schlüssel bekommen). Wenn aber der Server den Schlüssel bekommt, könnte der Server-Betreiber (in der Theorie) deine Nachricht entschlüsseln und lesen, und Du könntest das nicht einmal feststellen. Aber <strong>mit Javascript ist deine Nachricht sicher</strong>, selbst vor bösartigen Servern, weil dein Schlüssel niemals versendet wird.

source: How is the encryption key transmitted to the recipient?
de: Wie wird der kryptographische Schlüssel zum Empfänger übermittelt?

# faq-key
source: The key is encoded in the <em>fragment</em> part of your secret url. This part of the url is kept local to your browser and never transmitted over network.
de: Der Schlüssel wird im <em>Fragment</em>-Teil deines geheimen Links codiert. Dieser Teil des Links bleibt lokal in deinem Browser und wird nicht übermittelt.

source: Can I check if the javascript is trustworthy?
de: Kann ich überprüfen ob der Javascript-Code vertrauenswürdig ist?

# faq-jstrust
source: The source code of this service is available on Github (<a>https://github.com/MarkusBauer/secretnote</a>), anyone can read and check it. To ensure this service uses unaltered javascript code, you can check the <em>integrity</em> hashes of the three javascript files. You find the hashes of this service when viewing the source code of this page. You find the hashes of the open source code when inspecting the current release. These releases are built by <a>TODO</a>, so not even the service operators could interfere with the build process.
de: Der Quellcode dieser Seite ist auf Github verfügbar (<a>https://github.com/MarkusBauer/secretnote</a>), jeder kann ihn lesen und überprüfen. Um sicherzustellen dass diese Seite unveränderten Javascript-Code nutzt kannst du die <em>integrity</em>-Hashes der drei Javascript-Dateien überprüfen. Du findest die Hashes dieser Seite wenn du dir den Quellcode dieser Seite anzeigen lässt. Die korrekten Hashes des öffentlich zugänglichen Quellcodes kannst du dir beim aktuellen Release anschauen. Diese Releases werden von <a>TODO</a> gebaut, sodass nicht einmal die Betreiber dieser Seite den Build-Prozess manipulieren können.

source: This note has already been read (or the link is invalid).
de: Diese Nachricht wurde bereits gelesen (oder der Link ist ungültig).

source: Note <code>{{ident}}</code> has not been read - yet.
de: Nachricht <code>{{ident}}</code> wurde noch nicht gelesen.

source: It can be retrieved with the <span>secret link</span> below - but only once
de: Sie kann mit dem unten stehenden <span>geheimen Link</span> abgerufen werden - aber nur einmal

source: You can check if the note was read using this <span>admin link</span>:
de: Sie können mit diesem <span>administrativen Link</span> überprüfen, ob die Nachricht gelesen wurde:

# about-text1
source: SecretNote is free and open source software, powered by Rust, Redis, Angular and Typescript. Anyone is free to host custom instances free of charge.
de: SecretNote ist freie, quelloffene Software, powered by Rust, Redis, Angular und Typescript. Jeder darf unbegrenzt und kostenlos eigene, angepasste Instanzen betreiben und nutzen.

source: Build time
de: Zeitstempel

source: Privacy Policy
de: Datenschutzerklärung

source: Scope:
de: Gültigkeitsbereich:

# gdpr-responsibility
source: <strong>Responsibility:</strong> For questions or requests regarding personal data contact <code>secretnote AT mk-bauer DOT de</code>. This website is hosted by <a>Uberspace</a> which process data for us. We signed a data processing contract with Uberspace.
de: <strong>Verantwortung:</strong> Bei Fragen oder Anfragen zur Nutzung persönlicher Daten wenden Sie sich bitte an <code>secretnote AT mk-bauer DOT de</code>. Diese Website wird bei <a>Uberspace</a> gehostet, die Daten verarbeiten. Wir haben mit Uberspace einen Vertrag zur Auftragsdatenverarbeitung geschlossen.

# gdpr-security
source: <strong>Security:</strong> We use modern methods to protect transfer and storage of personal information, including TLS encryption of all connections.
de: <strong>Sicherheit:</strong> Wir sichern ihre Daten auf dem aktuellen Stand der Technik, einschließlich TLS-Transportverschlüsselung aller Verbindungen.

# gdpr-data
source: <strong>Processed data:</strong> We process two types of personal data: User's encrypted messages and technical information about website access, including IP addresses.
de: <strong>Verarbeitete Daten:</strong> Wir verarbeiten zwei Arten von persönlichen Daten: Verschlüsselte Nachrichten und technische Daten über Zugriffe auf die Website, einschließlich IP-Addressen.

# gdpr-rights
source: <strong>Your rights:</strong> According to the GDPR, users have the right of access, correction or removal of personal information, or limitation of processing. We do not store data based on consent, as defined in Article 6 1a) GDPR.
de: <strong>Ihre Rechte:</strong> Nach der DSGVO haben Nutzer den Anspruch auf Auskunft, Berichtigung und Löschung der gespeicherten Daten, Einschränkung und Widerspruch der Verarbeitung der Daten. Wir speichern keine Daten basierend auf Einwilligung nach Artikel 6 1a) DSGVO.

# gdpr-usermessages
source: <strong>Processing of user messages:</strong> We process written messages solely in encrypted form, it is technically not possible for us to access this personal data. Processing is legally based on Article 6 1b) GDPR. The current retention period for messages is stated when storing new messages.
de: <strong>Verarbeitung von Nachrichten:</strong> Wir verarbeiten Nachrichten ausschließlich in verschlüsselter Form, es ist uns technisch nicht möglich auf den Inhalt dieser Nachrichten zuzugreifen. Die Verarbeitung stützt sich auf Artikel 6 1b) DSGVO. Die aktuelle Aufbewahrungsfrist wird vor dem Speichern der Nachrichten angezeigt.

# gdpr-serverdata
source: <strong>Processing of server data:</strong> We preserve the right to store server logs, containing your IP address and statistical information about your system (operating system and browser version). We use these logs for administrative purposes only, to keep up reliability, usability and security of this website. Processing is legally based on Article 6 1f) GDPR. Stored information are erased once we don't need them for the named purposes.
de: <strong>Verarbeitung von Server-Daten:</strong> Wir behalten uns vor, Server-Logs zu speichern, die allgemeine Informationen über Zugriffe auf die Website enthalten (einschließlich IP-Addresse, Betriebssystem und Browser-Version). Wir benutzen diese Server-Logs nur zu administrativen Zwecken, um den reibungslosen Betrieb, Stabilität und Sicherheit dieser Website sicherzustellen. Die Verarbeitung stützt sich auf Artikel 6 1f) DSGVO. Die gespeicherten Daten werden gelöscht, sobald sie nicht mehr für die genannten Zwecke benötigt werden.

# gdpr-changes
source: We reserve the right to change or update this privacy policy at any point in time.
de: Wir behalten uns vor, diese Datenschutzerklärung jederzeit anzupassen.

# warn_noteempty
source: Note is empty, please enter a note!
de: Nachricht ist leer, bitte geben Sie eine Nachricht ein!

# success_note
source: You can save the links now
de: Sie sollten die Links jetzt speichern

# success_note_header
source: Note has been created!
de: Nachricht wurde erstellt!

# error_link_invalid
source: This link is invalid
de: Dieser Link ist ungültig

# error_link_invalid_key
source: This link is invalid (encryption key corrupted)
de: Dieser Link ist ungültig (Schlüssel beschädigt)

# error_invalid_channelid
source: Invalid channel ID
de: Ungültige Chat-ID

# error_invalid_link_header
source: Invalid link
de: Ungültiger Link

# error_invalid_key
source: Invalid key
de: Ungültiger Schlüssel

# error_invalid_user_key
source: Invalid user key
de: Ungültiger Benutzer-Schlüssel

# error_invalid_message
source: Invalid message
de: Ungültige Nachricht
